Repository: nokuni/PlatformHour
Catalog: PlatformHour/Resources/Language/*.lproj/Localizable.strings
Languages: fr

source: Finally free !
fr: Enfin libre !

source: I was waiting so long for a body to come in this place...
fr: J'ai attendu si longtemps qu'une personne vienne dans cet endroit...

source: Thanks for saving me young ma...
fr: Merci de m'avoir sauvé jeune ma...

source: Oh no ! I did not pay attention ! You are not a mage, neither a human...
fr: Oh non ! Je n'ai pas fait attention ! Tu n'es pas un mage, ni un humain...

source: You are a... dice ? What a dice is doing here ?
fr: Tu es un... dé ? Qu'est-ce qu'un dé fait ici ?

source: I do not have any memories, the only thing I know is...
fr: Je n'ai plus de souvenirs, la seule chose dont je me rappelle, c'est...

source: ...my role was to assist young mage in their process of learning magic.
fr: ...que mon role était d'assister les jeunes mages durant leur apprentissage de la magie.

source: It's been a long time I did not see any forms of life.
fr: Cela fait longtemps que je n'ai pas vu de formes de vie.

source: But you are here... If I succeeded to attach myself to you, it means you have soul.
fr: Mais tu es là... Si j'ai réussi à m'attacher à toi, cela veut dire que tu as une âme.

source: How is it possible ? What happened to you ?
fr: Comment est-ce possible ? Que t'est-il arrivé ?

source: For now, we need to leave this place to gather some informations.
fr: Pour l'instant, on a besoin de quitter cet endroit pour réunir quelque informations.

source: It seems you can't do anything without me.
fr: Apparemment, tu ne peux pas faire grand chose sans moi.

source: You'll have to figure it out.
fr: Tu auras besoin de le découvrir par toi même.

source: If I run out of energy, we go bust.
fr: Si je n'ai plus d'énergie, on est fini.

source: Let's do it !
fr: Allez ! C'est parti !

source: Oh crap ! Some rocks are falling from the top !
fr: Ah mince ! Des rochers tombent du plafond !

source: This place seems really dangerous but do not worry.
fr: Cet endroit semble vraiment dangereux, mais ne t'en fais pas.

source: My energy serves as a barrier too.
fr: Mon energie sert de barrière aussi.

source: If you get hurt, you'll loose some energy instead of being crushed.
fr: Si tu te fais toucher, tu perdras un peu d'énergie au lieu de te faire écraser.

source: Still try not to spend too much energy, or we will never get out of here.
fr: Essaye quand même de ne dépenser trop d'énergie, ou nous ne sortirons jamais d'ici.

source: Oh ! Watch ! An active blue crystal !
fr: Oh ! Regarde ! Un cristal actif !

source: Come closer and touch it !
fr: Approche toi et touche le !

source: And one more thing...
fr: Et une chose de plus...

source: If we run out of energy, we are sure to be redirected directly to the last crystal we touched.
fr: Si on n'a plus d'énergie, on sera automatiquement rediriger vers le dernier cristal qu'on a touché.

source: Cool, nah ?
fr: Cool, non ?
